In [1]:
import numpy as np
import pandas as pd

### a)

In [3]:
cd = pd.read_excel("clinic_data.xlsx")
df = cd.copy()

In [25]:
df

       doctor  year      month  patients
0      Benitz  2012   November       172
1       Modin  2013     August       272
2      Leabow  2014   November       203
3  Vandergard  2014  September       259
4      Largay  2014     August       293
5       Jonas  2015   February       233
6       Carli  2017   February       301
7        Palm  2019      April       396
8     Dukette  2018    October       407
9       Modin  2010   November       390

### b)

In [26]:
df["doctor"]

0        Benitz
1         Modin
2        Leabow
3    Vandergard
4        Largay
5         Jonas
6         Carli
7          Palm
8       Dukette
9         Modin
Name: doctor, dtype: object

### c)

In [27]:
df.iloc[2:5,[0,3]]

       doctor  patients
2      Leabow       203
3  Vandergard       259
4      Largay       293

### d)

In [28]:
df.loc[:,["year","month","patients"]]

   year      month  patients
0  2012   November       172
1  2013     August       272
2  2014   November       203
3  2014  September       259
4  2014     August       293
5  2015   February       233
6  2017   February       301
7  2019      April       396
8  2018    October       407
9  2010   November       390

### e)

In [33]:
df[df.month=="November"]

   doctor  year     month  patients
0  Benitz  2012  November       172
2  Leabow  2014  November       203
9   Modin  2010  November       390

### f)

In [41]:
df[df.patients==df.patients.max()]

    doctor  year    month  patients
8  Dukette  2018  October       407

### g)

In [54]:
df[(df.month=="September") | (df.month=="February")]

       doctor  year      month  patients
3  Vandergard  2014  September       259
5       Jonas  2015   February       233
6       Carli  2017   February       301

### h)

In [58]:
df[(df.year>2014) & (df.patients<300)]

  doctor  year     month  patients
5  Jonas  2015  February       233

### i)

In [59]:
df[((df.month=="September") | (df.month=="February")) & (df.patients>250)]

       doctor  year      month  patients
3  Vandergard  2014  September       259
6       Carli  2017   February       301

### k)

In [61]:
df.loc[(df.doctor=="Benitz") | (df.doctor=="Carli"),["doctor","year","patients"]]

   doctor  year  patients
0  Benitz  2012       172
6   Carli  2017       301